test/artillery/artillery-test-lambda-users.yml
config:
  payload:
    path: "./payloads/usersPayload.csv"
    fields:
      - "firstName"
      - "lastName"
      - "email"
    skipHeader: true
  target: "https://mchfd7t6l4.execute-api.us-west-2.amazonaws.com"
  phases:
    - name: Warm Up
      duration: 10
      arrivalRate: 2
    - name: Ramp up
      duration: 10
      arrivalRate: 5
      rampTo: 10

scenarios:
  - flow:
    - post:
        url: "/users"
        json:
          firstName: "{{ firstName }}"
          lastName: "{{ lastName }}"
          email: "{{ email }}"
    - get:
        url: "/users"