test/artillery/artillery-user-id-lambda.yml
config:
  payload:
    path: "./payloads/usersIdPayload.csv"
    fields:
      - "firstName"
      - "lastName"
      - "email"
    skipHeader: true
  target: "https://mchfd7t6l4.execute-api.us-west-2.amazonaws.com"
  phases:
    - name: Warm Up
      duration: 60
      arrivalRate: 2
    - name: Ramp up
      duration: 120
      arrivalRate: 5
      rampTo: 60

scenarios:
  - flow:
      - post:
          url: "/users/5"
          json:
            firstName: "{{ firstName }}"
            lastName: "{{ lastName }}"
            email: "{{ email }}"
      - get:
          url: "/users/5"